app/controllers/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_article #as opposed to putting this method for edit, create and destroy methods
      @article = Article.find(params[:id])